SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( #BR_Black_57XX_9669
 Type ( Engine )
 WagonShape ( BR_Black_57XX_9669.s )
 
 Size ( 2.67216m 3.68553m 9.40612m )
 CentreOfGravity ( 0.0m 0.0m 0.0m )
 Centre ( 0m 1.89952m 0m )
 Mass ( 50.0t )
 InertiaTensor ( Box(2.67216m 3.68553m 9.40612m) )
 Coupling (
 Type ( chain )
 Spring (
 Stiffness ( 1e7N/m 1e7N/m )
 Damping ( 0.2e7N/m/s 0.2e7N/m/s )
 Break ( 1e8N 1e8N )
 r0 ( 0cm 0.78m )
 )
 CouplingHasRigidConnection ()
 Velocity ( 0.1m/s )
 )
 Coupling (
 Type ( chain )
 Spring (
 Stiffness ( 1e7N/m 1e7N/m )
 Damping ( 0.2e7N/m/s 0.2e7N/m/s )
 Break ( 1e8N 1e8N )
 r0 ( 0m 0.78m )
 )
 CouplingHasRigidConnection ()
 Velocity ( -0.1m/s )
 )
 Buffers (
 Spring (
 Stiffness ( 1e6N/m 5e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 r0 ( 0m 0.78m )
 )
 Centre ( 1.5 )
 Radius ( 1 )
 Angle ( 2.5deg )
 )

 Adheasion ( 0.175 0.375 2 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 240kN )
 DerailBufferForce ( 600kN )
 WheelRadius ( 3.0316m )
 NumWheels ( 4 )
 Friction (
 4035N/m/s 0 1mph 13.46N/m/s 1.8
 5.1N/rad/s 1 -1rad/s 0 1
 )
 IntakePoint ( 0.7 2.4 FuelWater )
 IntakePoint ( -1.99 2.73 FuelCoal )

 BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce( 57000N )
 MaxHandbrakeForce( 57000N )
 NumberOfHandbrakeLeverSteps( 25 )
 MaxReleaseRate( 5 )
 MaxApplicationRate( 5 )
 MaxAuxilaryChargingRate( 25 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 25 )
 
 Sound ( "..\\..\\common.sound\\SteamSoundsOrgUk\\#GWR-Manor-66-100-11.sms" )

 Lights ( 15

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( 0 1.75 -2.1 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.4 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ffe610 )
 Position ( 0 1.75 -2.1 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.4 )
 
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 3 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ff0000 )
 Position ( -0.964337 1.54137 -4.30736 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.0 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 2 )
 Unit ( 3 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ff808000 )
 Position ( -0.964337 1.54137 -4.30736 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.0 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ff808000 )
 Position ( 1.00523 1.36154 4.10657 )
 Azimuth ( 0 -5 -5 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( eeff8800 )
 Position ( 0 1.750 -2.1 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( eeff8800 )
 Position ( 0 1.75 -2.1 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 
 )
 
 )
 )

 
 Light ( 
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 0 )
 FadeOut ( 0 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ff7200 )
 Position ( 0 2.725 -2.1 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 Light ( 
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 0 )
 FadeOut ( 0 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffe610 )
 Position ( 0 2.725 -2.1 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 1 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffe610 )
 Position ( 0 10.0 -10.75 )
 Transition ( 0 )
 Radius ( 6.0 )
 Angle ( 90.0 )
 )
 )
 )
 
 Light ( 
 comment( Ashpan flashes ) 
 Type ( 0 ) 
 Conditions ( 
 Headlight ( 3 ) 
 Unit ( 0 ) 
 ) 
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 1 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -.6950 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.6950 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 2 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 01.4 -.6950 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 2 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.4 -.6950 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.6950 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -.6950 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 2 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 2 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.692 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.692 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 4 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -.692 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.692 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 4 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -.692 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.692 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 4 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.692 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 3 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 2 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 2 ) 
 ) 
 State ( 
 Duration ( 5 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 2 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.6950 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.6950 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.6950 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 2 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -.6950 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 2 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.6950 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -.695 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 3 ) 
 )
 )
 )
 Light ( 
 comment( Chimney Sparks RS1AA ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.41190 )

 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.22 3.41190 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.42 3.41190 )

 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.72 3.41190 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.52 3.41190 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.72 3.41190 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.92 3.4119 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.32 3.4119 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.52 3.4119 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.92 3.4119 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.226 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.35 3.4119 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.55 3.4119 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.25 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.4119 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.22 3.4119 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.22 3.4119 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.4119 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 3.4119 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.4119 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.4119 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0 5.22 3.4119 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.4119 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.225 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 5.22 3.4119 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.4119 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.4119 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.119 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.233 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 3.4119 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.4119 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 9.22 3.4119 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 )
 )
 )

 Light ( 
 comment( Chimney Sparks RS1AA ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 3.411 )

 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.411 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 7.22 3.411 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.411 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.234 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.411 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 3.411 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.234 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 3.411 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.2235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 8.22 3.411 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 3.411 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0 9.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.411 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 5.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 3.411 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 3.411 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 )
 )
 )
 
 Light (
 comment( Flickering Ashpan Front )
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 0.975 )
 FadeOut ( 0.975 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.8755 -0.579 )
 Azimuth ( -90 -90 -90 )
 Transition ( 0 )
 Radius ( 1.31)
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.8755 -0.579 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front )
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 2 )
 )
 FadeIn ( 0.75 )
 FadeOut ( 0.75 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.8755 -0.579 )
 Azimuth ( 45 45 45 )
 Transition ( 0 )
 Radius ( 1.3 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.8755 -0.579 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.31 )
 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front )
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 1.95 )
 FadeOut ( 1.95 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.8755 -0.579 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.3 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.8755 -0.579 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.310 )
 
 )
 )
 )
 
 )
 )


 

Engine ( #BR_Black_57XX_9669 
 Effects (
 SteamSpecialEffects
 (
 StackFX
 (
 0 3.76977 3.40614
 0 0.95 0
 0.2
 )
 SafetyValvesFX
 (
 0 3.465 -1.167080
 0 0.75 0
 0.25
 )
 SafetyValvesFX
 (
 0 3.465 -1.167080
 0 1.3 0
 0.25
 )
 WhistleFX
 (
 0 3.37901 -1.55021
 0 1 0
 0.1
 )
 CylindersFX
 (
 0.224 0.818 3.0
 0.1 -0.4 1.1
 0.1
 )
 CylindersFX
 (
 -0.224 0.818 3.0
 -0.1 -0.4 1.1
 0.1
 )
 )
 )

 Wagon ( #BR_Black_57XX_9669 )
 IsTenderRequired( -1 ) 
 Type ( Steam )
 MaxPower ( 975KW )
 MaxForce ( 100KN )
 MaxVelocity ( 52mph )
 WheelRadius ( 174.35in )
 Sanding ( 1e9mph )
 NumWheels ( 6 )
 BoilerLength ( 4.75m )
 BoilerRadius ( 0.66m )
 BoilerVolume ( 165 )
 BoilerEffectivity ( 1.20 )
 DraftingEffect ( 1.25 )
 BoilerResponsiveness ( 1 )
 CoalBurnage ( 4.2lb/hp/h )
 MaxBoilerOutput ( 17863lb/h )
 NumCylinders ( 2 )
 CylinderStroke ( 24in )
 CylinderDiameter ( 17.5in )
 CylinderVolume ( 6.7 )
 CylinderEffectivity ( 4 )
 InjectorSizes ( 9mm 9mm )
 ExhaustLimit ( 17863lb/h )
 SteamGaugeGlassHeight( 10 )
 PrimingFactor ( 1 )
 SteamMinPrimingLevel ( 1.1 )
 SteamPrimingPowerLossProportion ( 0.20 )
 SteamPrimingWaterUsageIncreaseProportion ( 0.25 )
 SteamPrimingInjectorsFailAtLevel ( 1.25 )
 SteamPrimingReductionWithCylinderCocksOpen ( 0.25 )
 BlastExponent ( 0.4750 )
 MaxBoilerPressure ( 200psi )
 MaxFireMass ( 600lb )
 IdealFireMass ( 600lb )
 MaxWaterMass ( 2634lb ) 
 SafetyValvesSteamUsage ( 5000lb/h )
 ShovelCoalMass ( 20lb )
 SmokeCombustion ( 20 )
 CriticalBlowbackLevel ( 1 ) 
 MaxTenderCoalMass ( 7392lb )
 MaxTenderWaterMass ( 12000lb )

 comment( 0 for live steam, 1 for exhaust steam )
 InjectorTypes( 0 0 )
 InjectorLimits1 ( 60psi 0.40 1 )
 InjectorLimits2 ( 60psi 0.40 1 )
 Injector1FeedrateMultiplierExhaust ( 1.15 )
 Injector1FeedrateMultiplierLive ( 0.95 )
 Injector2FeedrateMultiplierExhaust ( 1.15 )
 Injector2FeedrateMultiplierLive ( 0.95 )
 Injector1WaterValveVariance ( 0.75 )
 Injector2WaterValveVariance ( 0.75 )

 SuperHeater ( 1 )
 SteamSmokeUnitsPerPoundOfFuel( 0.70 )
 SteamMaxSmokeUnitsReleaseRate( 20 )
 MaxSteamHeatingPressure( 50 )
 SafetyValvePressureDifference( 5 )
 SteamFiremanMaxConstantFiringRate ( 4875 )
 BasicSteamUsage ( 1250lb/h )
 BasicCoalUsage ( 100lb/h )
 
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

 SteamSmallestCutoff( 6 )
 NumberOfDamperSteps( 9 )

 RegulatorValveType ( Twin_port )
 RegulatorPilotValveExponent( 0.5 )
 RegulatorPilotValveFullOpening( 0.3 )
 RegulatorSecondValveExponent( 1 )
 RegulatorSecondValveStartPosition( 0.5 )
 RegulatorMainValveInitialOpenning( 0.55 )

 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 900 ) comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.175 )
 SteamWaterScoopMinPickupSpeed( 250 )comment( mph )
 SteamWaterScoopMaxPickupSpeed( 750 )comment( mph )
 SteamWaterScoopResistance( 0N )
 comment( pounds per second. 0gallons per minute max. )
 SteamWaterScoopMaxPickupRate( 0 )

 VacuumBrakesSmallEjectorPowerRating( 55 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 1340 )
 VacuumBrakesLargeEjectorUsageRate( 1340 )
 VacuumBrakesHasVacuumPump( 1 )
 TrainBrakesControllerMaxApplicationRate( 5 )
 TrainBrakesControllerMaxReleaseRate( 5 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 25 )
 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )
 BrakesEngineBrakeType ( "Vacuum_single_pipe" )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Hand, Train" )
 TrainPipeLeakRate( 1 )


 
 

 EngineControllers (
 comment( Engine controls )
 
 Regulator ( 0 1 0.02 0 
 NumNotches( 0 )
 )

 Cutoff ( -0.75 0.75 0.025 0 
 NumNotches( 15
 Notch ( -0.75 0 Dummy )
 Notch ( -0.55 0 Dummy )
 Notch ( -0.45 0 Dummy )
 Notch ( -0.35 0 Dummy )
 Notch ( -0.25 0 Dummy )
 Notch ( -0.20 0 Dummy )
 Notch ( -0.15 0 Dummy )
 Notch ( 0.0 0 Dummy )
 Notch ( 0.15 0 Dummy )
 Notch ( 0.20 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.35 0 Dummy )
 Notch ( 0.45 0 Dummy )
 Notch ( 0.55 0 Dummy )
 Notch ( 0.75 0 Dummy )
 
 )

 )
 Brake_Train ( 0 0.99 0.1 0.98
 NumNotches( 2
 Notch(0.0 1 TrainBrakesControllerRunningStart )
 Notch(0.05 1 TrainBrakesControllerApplyStart )
 )
 )
 Brake_Hand ( 0 1 0.0125 0 
 NumNotches( 0 )
 )
 FireDoor ( 0 1 0.075 1 
 NumNotches( 0 )
 )
 Sanding( 0 1 0 )
 Blower ( 0 1 0.025 0.02 
 NumNotches( 0 )
 )
 HeatingTap ( 0 1 0.035 0 
 NumNotches( 5 
 Notch ( 0 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 
 )
 )
 Shovel ( 0 1 0.5 0 
 NumNotches( 0 )
 )

 DampersFront ( 0 1 0.1 0.15 
 NumNotches ( 9
 Notch ( 0 0 Dummy )
 Notch ( 0.125 0 Dummy )
 Notch ( 0.250 0 Dummy )
 Notch ( 0.375 0 Dummy )
 Notch ( 0.500 0 Dummy )
 Notch ( 0.625 0 Dummy )
 Notch ( 0.750 0 Dummy )
 Notch ( 0.875 0 Dummy )
 Notch ( 1 0 Dummy )
 ) 
 )

 Injector1Steam ( 0 1 0.025 0
 NumNotches( 4 
 Notch ( 0 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 
 )
 )
 Injector2Steam ( 0 1 0.025 0
 NumNotches( 4 
 Notch ( 0 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 
 )
 )

 Injector1Water ( 0 1 0.1 0 
 NumNotches( 2 
 Notch ( 0 0 Dummy )
 Notch ( 1 0 Dummy )

 )
 )
 
 Injector2Water ( 0 1 0.1 0 
 NumNotches( 4 
 Notch ( 0 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 
 )
 )

 CylinderCocks ( 0 1 1 )
 Whistle ( 0 1 0 )
 WaterScoop ( 0 1 0 )
 SmallEjectorOrCompressor( 0 1 1 )
 Headlights( 0 1 0 )
 )
 comment(fire temp, fire mass, water mass, boiler pressure,
 water level, tender_water_mass, tender_coal_mass,
 smoke_quantity, fire_condition, coal quality )
 
 EngineVariables( 900 600 1980 205 1 1300 60 100 1 0.70 )

 
 Name ( "# BR_57XX_9669" )
 Description (
 ""

 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+ 
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)